/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_abs.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: oyuhi <oyuhi@student.42tokyo.jp>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/09/16 14:44:52 by oyuhi             #+#    #+#             */
/*   Updated: 2024/09/16 14:44:54 by oyuhi            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_abs.h"
#include <stdio.h>

int	main(void)
{
	int	a;
	int	b;

	a = -42;
	b = 42;
	printf("ABS of %d is %d\n", a, ABS(a)); // 絶対値を表示
	printf("ABS of %d is %d\n", b, ABS(b));
	return (0);
}
